{
  "basics": {
    "name": "Jesús Borrero",
    "label": "Software Developer",
    "profileImage": "/jesubohr-small.jpg",
    "aboutImage": "/jesubohr-medium.jpg",
    "email": "jesus.borrero.fernandez@gmail.com",
    "resume": "https://resume.jesubohrdev.com",
    "summary": "*Software developer* working on great _digital experiences_.\nExperienced in building *websites* that provide users a _seamless experience_.",
    "profiles": [
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/jesusborrero/"
      },
      {
        "network": "GitHub",
        "url": "https://github.com/jesubohr"
      }
    ]
  },
  "about": "[Software Developer, passionate about *_technology and programming_*.] [Proficient in web development technologies, tools and methodologies, as *Git/GitHub, CI/CD, SOLID, etc.*, providing valuable solutions to any challenge.] [Enjoy working on *productive and collaborative teams*, making good relationships with my co-workers, while keeping *respect and empathy*.] [*_'First solve the problem, then write the code'_* is my motto.]",
  "experience": [
    {
      "company": "Freelance",
      "title": "Frontend Developer",
      "startDate": "2022-08-02",
      "endDate": "2023-09-02",
      "description": "- Web application development using technologies such as: HTML5, CSS3, JavaScript (ES6+), React, Angular, TailwindCSS, Sanity CMS, etc., in addition to the ideal handling of APIs needed in a web application.\n- Design and development of a custom website to promote the client's professional image and consulting services, including an SEO optimized blog. This resulted in an increase in lead acquisition during the first few months.\n- Implementation of a new design for a financial services web application, aimed at improving user experience and usability, resulting in a significant increase in satisfaction and greater interaction with the platform's key functionalities."
    },
    {
      "company": "SIP Ingeniería",
      "title": "Full Stack Developer",
      "link": "https://www.linkedin.com/company/sipingenieria/",
      "startDate": "2023-11-02",
      "description": "<strong>Financial auditing system for companies with help of AI tools</strong><br/>- Implementation of an automated notification system to alert users about critical events.<br/>- Implementation of two-factor authentication (2FA) in Python server-side, to improve system security in user authorization.<br/>-  Developed system that creates an audit engagement based on documents provided by the company, using AWS services and AI tools.<br/><br/><strong>AI-based code review system</strong><br/>- Integration of GPT API for analysis and generation of recommendations based on framework standards, architecture and/or conventions used in the company.<br/>- Increased code quality and adherence to best practices and standards by developers.<br/>- Reduction of code review time for senior developers by 50%, enabling faster development cycles.<br/><br/>Both projects deployed using Docker, ensuring software scalability and portability."
    },
    {
      "company": "Qollabs",
      "title": "Software Developer",
      "link": "https://www.qollabs.dev/",
      "startDate": "2025-01-02",
      "description": "I recently joined the team as a Software Developer specialized in Web Development. My focus is on frontend and backend technologies, always ready to contribute to the creation of solutions that bring tangible benefits to users, driving digital transformation in different markets. My main tools are: React, Angular, TailwindCSS, NextJS, PostgreSQL, Python, Typescript, etc., always focused on the best practices of software development."
    }
  ],
  "projects": [
    {
      "name": "Qollabs",
      "description": "Offering comprehensive technology solutions to bring digital transformation to companies and drive them into the future.",
      "image": "/projects/qollabs.jpg",
      "link": "https://www.qollabs.dev/",
      "tags": ["Astro", "Preact", "TailwindCSS"]
    },
    {
      "name": "Jaime Giraldo Website",
      "description": "Personal website for a client who wanted to promote his professional image by offering his consulting services and a blog to share his knowledge.",
      "image": "/projects/jaimegiraldo.jpg",
      "link": "https://jaimegiraldo.co/",
      "tags": ["Astro", "TailwindCSS", "Sanity"]
    },
    {
      "name": "HotKeyPad",
      "description": "Lightweight and simple way to add keyboard shortcuts to your web application.",
      "image": "/projects/hotkeypad.jpg",
      "repository": "https://github.com/jesubohr/hotkeypad",
      "tags": ["HTML5", "TypeScript"]
    },
    {
      "name": "BoxCloud",
      "description": "A cloud storage service with a clean UI, focused on simplicity and convenience.",
      "image": "/projects/boxcloud.jpg",
      "link": "https://boxcloudy.netlify.app/",
      "repository": "https://github.com/jesubohr/boxcloud",
      "tags": ["NextJS", "TailwindCSS"]
    },
    {
      "name": "Scales2Care",
      "description": "A PWA to help health professionals to apply certain risk scales on hospitalized patients.",
      "image": "/projects/scales2care.jpeg",
      "link": "https://scales2care.jesubohrdev.com/",
      "repository": "https://github.com/jesubohr/scales2care",
      "tags": ["React", "TailwindCSS", "PWA"]
    }
  ]
}
