{
  "basics": {
    "name": "Jesús Borrero",
    "label": "Software Developer",
    "profileImage": "https://avatars.githubusercontent.com/u/39781228?v=4",
    "aboutImage": "https://avatars.githubusercontent.com/u/39781228?v=4",
    "email": "jesus.borrero.fernandez@gmail.com",
    "resume": "https://resume.jesubohr.dev",
    "summary": "*Software developer* working on great _digital experiences_.\nExperienced in building *websites* that provide users a _seamless experience_.",
    "profiles": [
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/jesusborrero/"
      },
      {
        "network": "GitHub",
        "url": "https://github.com/jesubohr"
      }
    ]
  },
  "about": "[Software Developer, passionate about *_technology and programming_*.] [Proficient in web development technologies, tools and methodologies, as *Git/GitHub, CI/CD, SOLID, etc.*, providing valuable solutions to any challenge.] [Enjoy working on *productive and collaborative teams*, making good relationships with my co-workers, while keeping *respect and empathy*.] [*_'First solve the problem, then write the code'_* is my motto.]",
  "experience": [
    {
      "company": "Freelance",
      "title": "Frontend Developer",
      "startDate": "2022-01-02",
      "endDate": "2023-09-02",
      "description": "- Delivered multiple high-performance web applications and landing pages using React, Astro, and TailwindCSS, achieving faster load times and enhanced SEO metrics.\n- Integrated RESTful APIs into Angular applications, ensuring reliable and efficient frontend-backend communication.\n- Conducted A/B testing and performance audits, driving UX improvements and higher user engagement.\n- Managed client communication, translating business requirements into technical deliverables with clear documentation and timelines.\n\nParticipated in the frontend reimplementation of the user dashboard component system for a trading platform after a full product redesign. Refactored and rebuilt critical UI components in React and TypeScript, improving reusability, performance, and maintainability. Collaborated closely with designers and backend engineers to align visual changes and connecting API (through GraphQL), ensuring a seamless transition to the updated interface. Resulted in a cleaner architecture, a 30% reduction in code duplication, and faster iteration for future UI updates."
    },
    {
      "company": "SIP Ingeniería",
      "title": "Full Stack Developer",
      "link": "https://www.linkedin.com/company/sipingenieria/",
      "startDate": "2023-11-02",
      "description": "- Led the design and implementation of the frontend for an AI-based financial auditing system using React, TypeScript, and TailwindCSS, integrated with GPT models and AWS services.\n- Architected reusable component library, improving UI consistency and reducing feature delivery time by 35%.\n- Implemented secure 2FA, document parsing workflows, and data visualization dashboards for audit teams.\n- Mentored junior developers through code reviews and technical guidance, enhancing overall code quality and maintainability.\n\nOwned the end-to-end frontend architecture and implementation of an AI-driven financial auditing platform, built with React, TypeScript, and TailwindCSS. Collaborated closely with audit professionals and other developers to translate complex workflows into intuitive UI components and complete views. Implemented secure authentication (2FA), document upload workflows, and real-time collaboration modules integrated with GPT APIs and AWS services. Resulted in a robust, maintainable, and scalable frontend platform that accelerated audit reviews and improved user satisfaction across multiple client projects."
    }
  ],
  "projects": [
    {
      "name": "Qollabs",
      "description": "Offering comprehensive technology solutions to bring digital transformation to companies and drive them into the future.",
      "image": "/projects/qollabs.jpg",
      "link": "https://www.qollabs.dev/",
      "tags": ["Astro", "Preact", "TailwindCSS"]
    },
    {
      "name": "Jaime Giraldo Website",
      "description": "Personal website for a client who wanted to promote his professional image by offering his consulting services and a blog to share his knowledge.",
      "image": "/projects/jaimegiraldo.jpg",
      "link": "https://jaimegiraldo.co/",
      "tags": ["Astro", "TailwindCSS", "Sanity"]
    },
    {
      "name": "HotKeyPad",
      "description": "Lightweight and simple way to add keyboard shortcuts to your web application.",
      "image": "/projects/hotkeypad.jpg",
      "repository": "https://github.com/jesubohr/hotkeypad",
      "tags": ["HTML5", "TypeScript"]
    },
    {
      "name": "BoxCloud",
      "description": "A cloud storage service with a clean UI, focused on simplicity and convenience.",
      "image": "/projects/boxcloud.jpg",
      "link": "https://boxcloudy.netlify.app/",
      "repository": "https://github.com/jesubohr/boxcloud",
      "tags": ["NextJS", "TailwindCSS"]
    },
    {
      "name": "Scales2Care",
      "description": "A PWA to help health professionals to apply certain risk scales on hospitalized patients.",
      "image": "/projects/scales2care.jpeg",
      "link": "https://scales2care.jesubohrdev.com/",
      "repository": "https://github.com/jesubohr/scales2care",
      "tags": ["React", "TailwindCSS", "PWA"]
    }
  ]
}
